---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace
source: html/682f7cab-4620-f751-5c21-998e8e5d1c30.htm
---
# EnergyAnalysisSpace Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.